lemmingDev/ESP32-BLE-Gamepad/BleGamepad.cpp
#include <NimBLEDevice.h>
#include <NimBLEUtils.h>
#include <NimBLEServer.h>
#include "NimBLEHIDDevice.h"
#include "HIDTypes.h"
#include "HIDKeyboardTypes.h"
#include "sdkconfig.h"
#include "BleConnectionStatus.h"
#include "BleGamepad.h"
#include "NimBLELog.h"
#include "BleGamepadConfiguration.h"

#include <stdexcept>
#include "BleXInputDescriptors.h"
#include <type_traits>

// Verify wire-format sizes of packed report structs match the protocol spec.
// If these fail, the struct padding or packing is wrong on this platform.
static_assert(sizeof(XInputInputReport) == XINPUT_REPORT_LEN_INPUT,
              "XInputInputReport must be 18 bytes on wire");
static_assert(sizeof(XInputOutputReport) == XINPUT_REPORT_LEN_OUTPUT,
              "XInputOutputReport must be 8 bytes on wire");

// Clamp INT16_MIN (-32768) to INT16_MIN+1 (-32767) because some hosts treat
// -32768 as an invalid/uninitialized value.  All axis setters run through this.
static inline int16_t clampAxis(int16_t v)
{
  return v;
}

#if defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"
#define LOG_TAG "BLEGamepad"
#else
#include "esp_log.h"
static const char *LOG_TAG = "BLEGamepad";
#endif

#define SERVICE_UUID_DEVICE_INFORMATION         "180A"      // Service - Device information

#define CHARACTERISTIC_UUID_MODEL_NUMBER        "2A24"      // Characteristic - Model Number String - 0x2A24
#define CHARACTERISTIC_UUID_SOFTWARE_REVISION   "2A28"      // Characteristic - Software Revision String - 0x2A28
#define CHARACTERISTIC_UUID_SERIAL_NUMBER       "2A25"      // Characteristic - Serial Number String - 0x2A25
#define CHARACTERISTIC_UUID_FIRMWARE_REVISION   "2A26"      // Characteristic - Firmware Revision String - 0x2A26
#define CHARACTERISTIC_UUID_HARDWARE_REVISION   "2A27"      // Characteristic - Hardware Revision String - 0x2A27
#define CHARACTERISTIC_UUID_BATTERY_POWER_STATE "2A1A"      // Characteristic - Battery Power State - 0x2A1A

#if BLE_GAMEPAD_DEBUG == 1
static void dumpHIDReport(const uint8_t* report, size_t len);
#endif

BleGamepad::BleGamepad(std::string deviceName, std::string deviceManufacturer, uint8_t batteryLevel, bool delayAdvertising) : _buttons(),
  _specialButtons(0),
  _x(0),
  _y(0),
  _z(0),
  _rX(0),
  _rY(0),
  _rZ(0),
  _slider1(0),
  _slider2(0),
  _rudder(0),
  _throttle(0),
  _accelerator(0),
  _brake(0),
  _steering(0),
  _hat1(0),
  _hat2(0),
  _hat3(0),
  _hat4(0),
  _gX(0),
  _gY(0),
  _gZ(0),
  _aX(0),
  _aY(0),
  _aZ(0),
  _touch1X(0),
  _touch1Y(0),
  _touch1Pressure(0),
  _touch2X(0),
  _touch2Y(0),
  _touch2Pressure(0),
  _batteryPowerInformation(0),
  _dischargingState(0),
  _chargingState(0),
  _powerLevel(0),
  nusInitialized(false),
  xInputReceiver(nullptr),
  pServer(nullptr),
  nus(nullptr),
  hid(0),
  pCharacteristic_Power_State(0),
  configuration()
{
  this->resetButtons();
  this->deviceName = deviceName;
  this->deviceManufacturer = deviceManufacturer;
  this->batteryLevel = batteryLevel;
  this->delayAdvertising = delayAdvertising;
  this->connectionStatus = new BleConnectionStatus();
  
  hidReportDescriptorSize = 0;
  hidReportSize = 0;
  numOfButtonBytes = 0;

  enableOutputReport = false;
  outputReportLength = 64;
  enableFeatureReport = false;
  featureReportLength = 64;
}

void BleGamepad::resetButtons()
{
  memset(&_buttons, 0, sizeof(_buttons));
}

// Bounds-check macro for HID descriptor construction.  tempHidReportDescriptor
// is a fixed-size buffer; this catches overflows at runtime before they corrupt
// adjacent memory.
#define HID_DESC_CHECK(n) do { \
    if (hidReportDescriptorSize + (n) > (int)sizeof(tempHidReportDescriptor)) { \
      NIMBLE_LOGE(LOG_TAG, "HID descriptor overflow at byte %d (need %d more)", \
                  hidReportDescriptorSize, (n)); \
      return; \
    } \
  } while (0)

void BleGamepad::buildSInputDescriptor()
{
  // SInput owns Report IDs 0x01-0x03 outright (see BleSInput.h) -- it doesn't
  // layer on top of the configurable report below, it replaces it. One
  // collection with three fixed-size reports: Input 0x01 (regular gamepad
  // state), Input 0x02 (command/feature response), Output 0x03 (host ->
  // device commands). SDL's SInput driver reads/writes these by fixed byte
  // offset and doesn't parse this descriptor's field-level contents at all --
  // see GattVsHid.md.
  //
  // The top-level Usage Page/Usage below is Generic Desktop/Gamepad, NOT
  // Vendor Defined, and that part *does* matter, confirmed against a live
  // SDL3 build: SDL_HIDAPI_ShouldIgnoreDevice() (src/hidapi/SDL_hidapi.c)
  // discards any device from hidapi enumeration entirely -- before its VID/PID
  // is even checked against SDL_IsJoystickSInputController() -- unless its top
  // -level usage is Generic Desktop Joystick/Gamepad/MultiAxisController (this
  // is gated by the SDL_HINT_JOYSTICK_HIDAPI_CONTROLLERS hint, default on). A
  // Vendor Defined top-level usage here means the device never reaches SDL's
  // gamepad layer at all, regardless of everything else being correct.

  // USAGE_PAGE (Generic Desktop)
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x05;
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

  // USAGE (Gamepad)
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x09;
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x05;

  // COLLECTION (Application)
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0xa1;
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x01;

  // Input Report 0x01 (regular gamepad state). Unlike Reports 0x02/0x03
  // below, this one's buttons/axes fields carry real HID usages (Button,
  // Generic Desktop X/Y/Z/Rz/Rx/Ry) over the exact same bytes SDL's SInput
  // driver already reads by fixed offset -- SDL ignores usage annotations
  // entirely, but the kernel's hid-generic/hid-input driver needs them to
  // map fields to evdev BTN_*/ABS_* codes. Without this, SDL still works
  // (confirmed), but nothing else does -- no /dev/input/js*, no plain
  // jstest/evtest, no non-SInput-aware app. With it, both paths work off
  // the same bytes.
  HID_DESC_CHECK(128); // Reserve margin for Report 0x01 (regular gamepad state)
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0x85; // REPORT_ID
  tempHidReportDescriptor[hidReportDescriptorSize++] = SINPUT_REPORT_ID_INPUT;

