lemmingDev/ESP32-BLE-Gamepad/BleGamepad.cpp
  // END_COLLECTION (Application)
  tempHidReportDescriptor[hidReportDescriptorSize++] = 0xc0;
}

void BleGamepad::buildXInputDescriptor()
{
  // Xbox One S / Series X Bluetooth HID descriptor.
  // Adapted from Mystfit/ESP32-BLE-CompositeHID (MIT license), itself reverse
  // engineered from real Xbox controller BLE captures. Both Xbox One S
  // (PID 0x02FD) and Xbox Series X (PID 0x0B13) share this same descriptor
  // layout; only the PnP PID differs.
  memcpy(tempHidReportDescriptor, XboxInputDescriptor, XboxInputDescriptorSize);
  hidReportDescriptorSize = XboxInputDescriptorSize;
}

void BleGamepad::begin(BleGamepadConfiguration *config)
{
  BleGamepadConfiguration defaultConfig;
  configuration = config ? *config : defaultConfig;

  GamepadMode mode = configuration.getGamepadMode();
  if (mode == GamepadMode::SInput || mode == GamepadMode::XInput || mode == GamepadMode::XInputSeriesX)
  {
    configuration.setIncludeSlider1(false);
    configuration.setIncludeSlider2(false);
    configuration.setIncludeRudder(false);
    configuration.setIncludeThrottle(false);
    configuration.setIncludeAccelerator(false);
    configuration.setIncludeBrake(false);
    configuration.setIncludeSteering(false);
    configuration.setIncludeGyroscope(false);
    configuration.setIncludeAccelerometer(false);
    configuration.setEnableOutputReport(false);
    configuration.setEnableFeatureReport(false);
    configuration.setHatSwitchCount(1);

    if (mode == GamepadMode::SInput)
      configuration.setButtonCount(25);
    else
      configuration.setButtonCount(11);

    if (mode == GamepadMode::SInput)
    {
      if (configuration.getVid() != SINPUT_USB_VID || configuration.getPid() != SINPUT_USB_PID_GENERIC)
        Serial.println("WARNING: SInput mode requires VID 0x2E8A / PID 0x10C6 for host recognition. Do not override setVid()/setPid().");
    }
    else if (mode == GamepadMode::XInput || mode == GamepadMode::XInputSeriesX)
    {
      if (configuration.getVid() != XINPUT_USB_VID)
        Serial.println("WARNING: XInput mode requires VID 0x045E for Xbox driver recognition. Do not override setVid()/setPid().");
    }
  }

  enableOutputReport = configuration.getEnableOutputReport();
  outputReportLength = configuration.getOutputReportLength();
  enableFeatureReport = configuration.getEnableFeatureReport();
  featureReportLength = configuration.getFeatureReportLength();
  enableSInput = configuration.getEnableSInput();

  genericButtonPaddingBits = 8 - (configuration.getButtonCount() % 8);
  if (genericButtonPaddingBits == 8)
  {
    genericButtonPaddingBits = 0;
  }
  genericSpecialButtonPaddingBits = 8 - (configuration.getTotalSpecialButtonCount() % 8);
  if (genericSpecialButtonPaddingBits == 8)
  {
    genericSpecialButtonPaddingBits = 0;
  }

  // Precompute bit positions for each special button so press/release don't
  // need to iterate the configuration array on every call.
  uint8_t pos = 0;
  for (int i = 0; i < POSSIBLESPECIALBUTTONS; i++)
  {
    _specialButtonPositions[i] = pos;
    if (configuration.getWhichSpecialButtons()[i]) pos++;
  }

  uint8_t numOfAxisBytes = configuration.getAxisCount() * 2;
  uint8_t numOfSimulationBytes = configuration.getSimulationCount() * 2;

  numOfButtonBytes = configuration.getButtonCount() / 8;
  if (genericButtonPaddingBits > 0)
  {
    numOfButtonBytes++;
  }

  uint8_t numOfSpecialButtonBytes = configuration.getTotalSpecialButtonCount() / 8;
  if (genericSpecialButtonPaddingBits > 0)
  {
    numOfSpecialButtonBytes++;
  }
  
  uint8_t numOfMotionBytes = 0;
  if (configuration.getIncludeAccelerometer())
  {
    numOfMotionBytes += 6;
  }
  
  if (configuration.getIncludeGyroscope())
  {
    numOfMotionBytes += 6;
  }

  hidReportSize = numOfButtonBytes + numOfSpecialButtonBytes + numOfAxisBytes + numOfSimulationBytes + numOfMotionBytes + configuration.getHatSwitchCount();

  if (mode == GamepadMode::SInput)
  {
    enableSInput = true;
    buildSInputDescriptor();
  }
  else if (mode == GamepadMode::XInput || mode == GamepadMode::XInputSeriesX)
  {
    enableSInput = false;
    buildXInputDescriptor();
  }
  else
  {
    enableSInput = false;
    buildGenericDescriptor();
  }

  // Set task priority from 5 to 1 in order to get ESP32-C3 working
  xTaskCreate(this->taskServer, "server", 20000, (void *)this, 1, NULL);
}

void BleGamepad::end(void)
{
  delete outputReceiver;
  outputReceiver = nullptr;
  delete featureReceiver;
  featureReceiver = nullptr;
  delete sInputReceiver;
  sInputReceiver = nullptr;
  delete xInputReceiver;
  xInputReceiver = nullptr;
  delete connectionStatus;
  connectionStatus = nullptr;
  delete[] outputBackupBuffer;
  outputBackupBuffer = nullptr;
  delete[] featureBackupBuffer;
  featureBackupBuffer = nullptr;
}

void BleGamepad::setAxes(int16_t x, int16_t y, int16_t z, int16_t rX, int16_t rY, int16_t rZ, int16_t slider1, int16_t slider2)
{
  x = clampAxis(x);
  y = clampAxis(y);
  z = clampAxis(z);
  rZ = clampAxis(rZ);
  rX = clampAxis(rX);
  rY = clampAxis(rY);
  slider1 = clampAxis(slider1);
  slider2 = clampAxis(slider2);

  _x = x;
  _y = y;
  _z = z;
  _rZ = rZ;
  _rX = rX;
  _rY = rY;
  _slider1 = slider1;
  _slider2 = slider2;

  if (configuration.getAutoReport())
  {
    sendReport();
  }
}

void BleGamepad::setHIDAxes(int16_t x, int16_t y, int16_t z, int16_t rZ, int16_t rX, int16_t rY, int16_t slider1, int16_t slider2)
{
  x = clampAxis(x);
  y = clampAxis(y);
  z = clampAxis(z);
  rZ = clampAxis(rZ);
  rX = clampAxis(rX);
  rY = clampAxis(rY);
  slider1 = clampAxis(slider1);
  slider2 = clampAxis(slider2);

  _x = x;
  _y = y;
  _z = z;
  _rZ = rZ;
  _rX = rX;
  _rY = rY;
  _slider1 = slider1;
  _slider2 = slider2;

  if (configuration.getAutoReport())
  {
    sendReport();
  }
}

void BleGamepad::setSimulationControls(int16_t rudder, int16_t throttle, int16_t accelerator, int16_t brake, int16_t steering)
{
  rudder = clampAxis(rudder);
  throttle = clampAxis(throttle);
  accelerator = clampAxis(accelerator);
  brake = clampAxis(brake);
  steering = clampAxis(steering);

  _rudder = rudder;
  _throttle = throttle;
  _accelerator = accelerator;
  _brake = brake;
  _steering = steering;

