lemmingDev/ESP32-BLE-Gamepad/BleGamepad.cpp
  if (configuration.getAutoReport())
  {
    sendReport();
  }
}

void BleGamepad::setHats(signed char hat1, signed char hat2, signed char hat3, signed char hat4)
{
  _hat1 = hat1;
  _hat2 = hat2;
  _hat3 = hat3;
  _hat4 = hat4;

  if (configuration.getAutoReport())
  {
    sendReport();
  }
}

void BleGamepad::setSliders(int16_t slider1, int16_t slider2)
{
  slider1 = clampAxis(slider1);
  slider2 = clampAxis(slider2);

  _slider1 = slider1;
  _slider2 = slider2;

  if (configuration.getAutoReport())
  {
    sendReport();
  }
}

void BleGamepad::sendReport(void)
{
  if (!this->isConnected())
  {
    return;
  }

  if (enableSInput)
  {
    sendSInputReport();
  }
  else if (configuration.getGamepadMode() == GamepadMode::XInput ||
           configuration.getGamepadMode() == GamepadMode::XInputSeriesX)
  {
    sendXInputReport();
  }
  else
  {
    sendGenericReport();
  }
}

void BleGamepad::sendSInputReport()
{
  uint8_t m[SINPUT_REPORT_LEN_INPUT];
  memset(m, 0, sizeof(m));

  // Derived from the same state setBatteryLevel()/setBatteryPowerInformation()/
  // setChargingState()/setDischargingState() already drive for the standard BLE
  // Battery Service (0x180F) -- SInput doesn't read that GATT service (see
  // GattVsHid.md), so it needs its own copy of the same information here.
  // There's no dedicated signal in this library for "finished charging", so
  // SINPUT_PLUG_STATUS_CHARGED is never produced; a still-connected charger
  // that's stopped topping up reports as SINPUT_PLUG_STATUS_CHARGING.
  uint8_t plugStatus = SINPUT_PLUG_STATUS_UNKNOWN;
  if (_chargingState == POWER_STATE_CHARGING)
  {
    plugStatus = SINPUT_PLUG_STATUS_CHARGING;
  }
  else if (_batteryPowerInformation == POWER_STATE_NOT_PRESENT || _batteryPowerInformation == POWER_STATE_NOT_SUPPORTED)
  {
    plugStatus = SINPUT_PLUG_STATUS_NO_BATTERY;
  }
  else if (_dischargingState == POWER_STATE_DISCHARGING)
  {
    plugStatus = SINPUT_PLUG_STATUS_ON_BATTERY;
  }
  m[SINPUT_IN_IDX_PLUG_STATUS] = plugStatus;
  m[SINPUT_IN_IDX_CHARGE_LEVEL] = batteryLevel;

  uint8_t buttons0 = 0;
  if (configuration.getButtonCount() >= 1 && isPressed(BUTTON_1)) buttons0 |= SINPUT_BTN0_SOUTH;
  if (configuration.getButtonCount() >= 2 && isPressed(BUTTON_2)) buttons0 |= SINPUT_BTN0_EAST;
  if (configuration.getButtonCount() >= 3 && isPressed(BUTTON_3)) buttons0 |= SINPUT_BTN0_WEST;
  if (configuration.getButtonCount() >= 4 && isPressed(BUTTON_4)) buttons0 |= SINPUT_BTN0_NORTH;
  if (configuration.getHatSwitchCount() >= 1)
  {
    if (_hat1 == HAT_UP || _hat1 == HAT_UP_RIGHT || _hat1 == HAT_UP_LEFT) buttons0 |= SINPUT_BTN0_DUP;
    if (_hat1 == HAT_DOWN_RIGHT || _hat1 == HAT_DOWN || _hat1 == HAT_DOWN_LEFT) buttons0 |= SINPUT_BTN0_DDOWN;
    if (_hat1 == HAT_DOWN_LEFT || _hat1 == HAT_LEFT || _hat1 == HAT_UP_LEFT) buttons0 |= SINPUT_BTN0_DLEFT;
    if (_hat1 == HAT_UP_RIGHT || _hat1 == HAT_RIGHT || _hat1 == HAT_DOWN_RIGHT) buttons0 |= SINPUT_BTN0_DRIGHT;
  }
  m[SINPUT_IN_IDX_BUTTONS_0] = buttons0;

  uint8_t buttons1 = 0;
  if (configuration.getButtonCount() >= 7  && isPressed(BUTTON_7))  buttons1 |= SINPUT_BTN1_LSTICK;
  if (configuration.getButtonCount() >= 8  && isPressed(BUTTON_8))  buttons1 |= SINPUT_BTN1_RSTICK;
  if (configuration.getButtonCount() >= 5  && isPressed(BUTTON_5))  buttons1 |= SINPUT_BTN1_LSHOULDER;
  if (configuration.getButtonCount() >= 6  && isPressed(BUTTON_6))  buttons1 |= SINPUT_BTN1_RSHOULDER;
  if (configuration.getButtonCount() >= 9  && isPressed(BUTTON_9))  buttons1 |= SINPUT_BTN1_LTRIGGER;
  if (configuration.getButtonCount() >= 10 && isPressed(BUTTON_10)) buttons1 |= SINPUT_BTN1_RTRIGGER;
  if (configuration.getButtonCount() >= 11 && isPressed(BUTTON_11)) buttons1 |= SINPUT_BTN1_LPADDLE1;
  if (configuration.getButtonCount() >= 12 && isPressed(BUTTON_12)) buttons1 |= SINPUT_BTN1_RPADDLE1;
  m[SINPUT_IN_IDX_BUTTONS_1] = buttons1;

  // buttons_2: map special buttons + regular buttons to SInput's fixed bit positions
  uint8_t buttons2 = 0;
  if (configuration.getIncludeStart())
  {
      uint8_t bit = specialButtonBitPosition(START_BUTTON);
      if (_specialButtons & (1 << bit)) buttons2 |= SINPUT_BTN2_START;
  }
  if (configuration.getIncludeBack() || configuration.getIncludeSelect())
  {
      // Map both Select and Back to SInput's "Back" bit
      uint8_t selectBit = specialButtonBitPosition(SELECT_BUTTON);
      uint8_t backBit = specialButtonBitPosition(BACK_BUTTON);
      if ((_specialButtons & (1 << selectBit)) || (_specialButtons & (1 << backBit)))
          buttons2 |= SINPUT_BTN2_BACK;
  }
  if (configuration.getIncludeHome())
  {
      uint8_t bit = specialButtonBitPosition(HOME_BUTTON);
      if (_specialButtons & (1 << bit)) buttons2 |= SINPUT_BTN2_GUIDE;
  }
  if (configuration.getButtonCount() >= 13 && isPressed(BUTTON_13)) buttons2 |= SINPUT_BTN2_CAPTURE;
  if (configuration.getButtonCount() >= 14 && isPressed(BUTTON_14)) buttons2 |= SINPUT_BTN2_LPADDLE2;
  if (configuration.getButtonCount() >= 15 && isPressed(BUTTON_15)) buttons2 |= SINPUT_BTN2_RPADDLE2;
  if (configuration.getButtonCount() >= 16 && isPressed(BUTTON_16)) buttons2 |= SINPUT_BTN2_TOUCHPAD1;
  if (configuration.getButtonCount() >= 17 && isPressed(BUTTON_17)) buttons2 |= SINPUT_BTN2_TOUCHPAD2;
  m[SINPUT_IN_IDX_BUTTONS_2] = buttons2;

  // buttons_3: Power + Misc1-7
  uint8_t buttons3 = 0;
  if (configuration.getButtonCount() >= 18 && isPressed(BUTTON_18)) buttons3 |= SINPUT_BTN3_POWER;
  if (configuration.getButtonCount() >= 19 && isPressed(BUTTON_19)) buttons3 |= SINPUT_BTN3_MISC1;
  if (configuration.getButtonCount() >= 20 && isPressed(BUTTON_20)) buttons3 |= SINPUT_BTN3_MISC2;
  if (configuration.getButtonCount() >= 21 && isPressed(BUTTON_21)) buttons3 |= SINPUT_BTN3_MISC3;
  if (configuration.getButtonCount() >= 22 && isPressed(BUTTON_22)) buttons3 |= SINPUT_BTN3_MISC4;
  if (configuration.getButtonCount() >= 23 && isPressed(BUTTON_23)) buttons3 |= SINPUT_BTN3_MISC5;
  if (configuration.getButtonCount() >= 24 && isPressed(BUTTON_24)) buttons3 |= SINPUT_BTN3_MISC6;
  if (configuration.getButtonCount() >= 25 && isPressed(BUTTON_25)) buttons3 |= SINPUT_BTN3_MISC7;
  m[SINPUT_IN_IDX_BUTTONS_3] = buttons3;

  if (configuration.getIncludeXAxis() && configuration.getIncludeYAxis())
  {
    m[SINPUT_IN_IDX_LEFT_X] = (uint8_t)_x;
    m[SINPUT_IN_IDX_LEFT_X + 1] = (uint8_t)(_x >> 8);
    m[SINPUT_IN_IDX_LEFT_Y] = (uint8_t)_y;
    m[SINPUT_IN_IDX_LEFT_Y + 1] = (uint8_t)(_y >> 8);
  }
  if (configuration.getIncludeZAxis() && configuration.getIncludeRzAxis())
  {
    m[SINPUT_IN_IDX_RIGHT_X] = (uint8_t)_z;
    m[SINPUT_IN_IDX_RIGHT_X + 1] = (uint8_t)(_z >> 8);
    m[SINPUT_IN_IDX_RIGHT_Y] = (uint8_t)_rZ;
    m[SINPUT_IN_IDX_RIGHT_Y + 1] = (uint8_t)(_rZ >> 8);
  }
  if (configuration.getIncludeRxAxis())
  {
    m[SINPUT_IN_IDX_LEFT_TRIGGER] = (uint8_t)_rX;
    m[SINPUT_IN_IDX_LEFT_TRIGGER + 1] = (uint8_t)(_rX >> 8);
  }
  if (configuration.getIncludeRyAxis())
  {
    m[SINPUT_IN_IDX_RIGHT_TRIGGER] = (uint8_t)_rY;
    m[SINPUT_IN_IDX_RIGHT_TRIGGER + 1] = (uint8_t)(_rY >> 8);
  }

  // IMU data (accelerometer + gyroscope)
  if (configuration.getEnableSInputIMU())
  {
    // Timestamp in microseconds since boot (monotonically increasing)
    uint32_t timestampUs = (uint32_t)millis() * 1000;
    m[SINPUT_IN_IDX_IMU_TIMESTAMP]     = (uint8_t)timestampUs;
    m[SINPUT_IN_IDX_IMU_TIMESTAMP + 1] = (uint8_t)(timestampUs >> 8);
    m[SINPUT_IN_IDX_IMU_TIMESTAMP + 2] = (uint8_t)(timestampUs >> 16);
    m[SINPUT_IN_IDX_IMU_TIMESTAMP + 3] = (uint8_t)(timestampUs >> 24);

