lemmingDev/ESP32-BLE-Gamepad/BleGamepad.cpp
    m[SINPUT_IN_IDX_IMU_ACCEL_X]     = (uint8_t)_aX;
    m[SINPUT_IN_IDX_IMU_ACCEL_X + 1] = (uint8_t)(_aX >> 8);
    m[SINPUT_IN_IDX_IMU_ACCEL_Y]     = (uint8_t)_aY;
    m[SINPUT_IN_IDX_IMU_ACCEL_Y + 1] = (uint8_t)(_aY >> 8);
    m[SINPUT_IN_IDX_IMU_ACCEL_Z]     = (uint8_t)_aZ;
    m[SINPUT_IN_IDX_IMU_ACCEL_Z + 1] = (uint8_t)(_aZ >> 8);

    m[SINPUT_IN_IDX_IMU_GYRO_X]     = (uint8_t)_gX;
    m[SINPUT_IN_IDX_IMU_GYRO_X + 1] = (uint8_t)(_gX >> 8);
    m[SINPUT_IN_IDX_IMU_GYRO_Y]     = (uint8_t)_gY;
    m[SINPUT_IN_IDX_IMU_GYRO_Y + 1] = (uint8_t)(_gY >> 8);
    m[SINPUT_IN_IDX_IMU_GYRO_Z]     = (uint8_t)_gZ;
    m[SINPUT_IN_IDX_IMU_GYRO_Z + 1] = (uint8_t)(_gZ >> 8);
  }

  // Touchpad data
  if (configuration.getEnableTouchpad())
  {
    m[SINPUT_IN_IDX_TOUCH1_X]     = (uint8_t)_touch1X;
    m[SINPUT_IN_IDX_TOUCH1_X + 1] = (uint8_t)(_touch1X >> 8);
    m[SINPUT_IN_IDX_TOUCH1_Y]     = (uint8_t)_touch1Y;
    m[SINPUT_IN_IDX_TOUCH1_Y + 1] = (uint8_t)(_touch1Y >> 8);
    m[SINPUT_IN_IDX_TOUCH1_P]     = (uint8_t)_touch1Pressure;
    m[SINPUT_IN_IDX_TOUCH1_P + 1] = (uint8_t)(_touch1Pressure >> 8);

    m[SINPUT_IN_IDX_TOUCH2_X]     = (uint8_t)_touch2X;
    m[SINPUT_IN_IDX_TOUCH2_X + 1] = (uint8_t)(_touch2X >> 8);
    m[SINPUT_IN_IDX_TOUCH2_Y]     = (uint8_t)_touch2Y;
    m[SINPUT_IN_IDX_TOUCH2_Y + 1] = (uint8_t)(_touch2Y >> 8);
    m[SINPUT_IN_IDX_TOUCH2_P]     = (uint8_t)_touch2Pressure;
    m[SINPUT_IN_IDX_TOUCH2_P + 1] = (uint8_t)(_touch2Pressure >> 8);
  }

  this->sInputGamepad->setValue(m, sizeof(m));
  this->sInputGamepad->notify();
}

void BleGamepad::sendXInputReport()
{
  XInputInputReport report;
  memset(&report, 0, sizeof(report));

  // Sticks: int16 (-32767..32767) → uint16 (0..65535, center = 0x8000)
  if (configuration.getIncludeXAxis() && configuration.getIncludeYAxis())
  {
    report.x = (uint16_t)((int32_t)_x + XBOX_AXIS_CENTER_OFFSET);
    report.y = (uint16_t)((int32_t)_y + XBOX_AXIS_CENTER_OFFSET);
  }
  else
  {
    report.x = XBOX_AXIS_CENTER_OFFSET;
    report.y = XBOX_AXIS_CENTER_OFFSET;
  }
  if (configuration.getIncludeZAxis() && configuration.getIncludeRzAxis())
  {
    report.z = (uint16_t)((int32_t)_z + XBOX_AXIS_CENTER_OFFSET);
    report.rz = (uint16_t)((int32_t)_rZ + XBOX_AXIS_CENTER_OFFSET);
  }
  else
  {
    report.z = XBOX_AXIS_CENTER_OFFSET;
    report.rz = XBOX_AXIS_CENTER_OFFSET;
  }

  // Triggers: int16 (0..32767) → uint10 (0..1023)
  if (configuration.getIncludeRxAxis())
  {
    report.brake = (uint16_t)((uint32_t)_rX * XBOX_TRIGGER_MAX / 32767);
  }
  if (configuration.getIncludeRyAxis())
  {
    report.accelerator = (uint16_t)((uint32_t)_rY * XBOX_TRIGGER_MAX / 32767);
  }

  // Hat switch: HAT_* → Xbox 4-bit encoding
  if (configuration.getHatSwitchCount() >= 1)
  {
    switch (_hat1)
    {
      case HAT_UP:        report.hat = XBOX_DPAD_NORTH; break;
      case HAT_UP_RIGHT:  report.hat = XBOX_DPAD_NORTHEAST; break;
      case HAT_RIGHT:     report.hat = XBOX_DPAD_EAST; break;
      case HAT_DOWN_RIGHT:report.hat = XBOX_DPAD_SOUTHEAST; break;
      case HAT_DOWN:      report.hat = XBOX_DPAD_SOUTH; break;
      case HAT_DOWN_LEFT: report.hat = XBOX_DPAD_SOUTHWEST; break;
      case HAT_LEFT:      report.hat = XBOX_DPAD_WEST; break;
      case HAT_UP_LEFT:   report.hat = XBOX_DPAD_NORTHWEST; break;
      default:            report.hat = XBOX_DPAD_NONE; break;
    }
  }

  // Buttons: map BUTTON_1..15 to Xbox bitmask
  uint16_t btns = 0;
  if (configuration.getButtonCount() >= 1  && isPressed(BUTTON_1))  btns |= XBOX_BUTTON_A;
  if (configuration.getButtonCount() >= 2  && isPressed(BUTTON_2))  btns |= XBOX_BUTTON_B;
  if (configuration.getButtonCount() >= 3  && isPressed(BUTTON_3))  btns |= XBOX_BUTTON_X;
  if (configuration.getButtonCount() >= 4  && isPressed(BUTTON_4))  btns |= XBOX_BUTTON_Y;
  if (configuration.getButtonCount() >= 5  && isPressed(BUTTON_5))  btns |= XBOX_BUTTON_LB;
  if (configuration.getButtonCount() >= 6  && isPressed(BUTTON_6))  btns |= XBOX_BUTTON_RB;
  if (configuration.getButtonCount() >= 7  && isPressed(BUTTON_7))  btns |= XBOX_BUTTON_LS;
  if (configuration.getButtonCount() >= 8  && isPressed(BUTTON_8))  btns |= XBOX_BUTTON_RS;
  if (configuration.getButtonCount() >= 9  && isPressed(BUTTON_9))  btns |= XBOX_BUTTON_SELECT;
  if (configuration.getButtonCount() >= 10 && isPressed(BUTTON_10)) btns |= XBOX_BUTTON_START;
  if (configuration.getButtonCount() >= 11 && isPressed(BUTTON_11)) btns |= XBOX_BUTTON_HOME;

  // Map special buttons to Xbox buttons
  if (configuration.getIncludeStart())
  {
    uint8_t bit = specialButtonBitPosition(START_BUTTON);
    if (_specialButtons & (1 << bit)) btns |= XBOX_BUTTON_START;
  }
  if (configuration.getIncludeSelect())
  {
    uint8_t bit = specialButtonBitPosition(SELECT_BUTTON);
    if (_specialButtons & (1 << bit)) btns |= XBOX_BUTTON_SELECT;
  }
  if (configuration.getIncludeHome())
  {
    uint8_t bit = specialButtonBitPosition(HOME_BUTTON);
    if (_specialButtons & (1 << bit)) btns |= XBOX_BUTTON_HOME;
  }
  report.buttons = btns;

  // Share button (separate byte)
  if (configuration.getIncludeBack())
  {
    uint8_t bit = specialButtonBitPosition(BACK_BUTTON);
    if (_specialButtons & (1 << bit)) report.share = XBOX_BUTTON_SHARE;
  }

  this->xInputGamepad->setValue((uint8_t *)&report, sizeof(report));
  this->xInputGamepad->notify();
}

void BleGamepad::sendGenericReport()
{
  uint8_t currentReportIndex = 0;

  uint8_t m[hidReportSize];

  memset(&m, 0, sizeof(m));
  memcpy(&m, &_buttons, sizeof(_buttons));

  currentReportIndex += numOfButtonBytes;

  if (configuration.getTotalSpecialButtonCount() > 0)
  {
    m[currentReportIndex++] = _specialButtons;
  }

  if (configuration.getIncludeXAxis())
  {
    m[currentReportIndex++] = _x;
    m[currentReportIndex++] = (_x >> 8);
  }
  if (configuration.getIncludeYAxis())
  {
    m[currentReportIndex++] = _y;
    m[currentReportIndex++] = (_y >> 8);
  }
  if (configuration.getIncludeZAxis())
  {
    m[currentReportIndex++] = _z;
    m[currentReportIndex++] = (_z >> 8);
  }
  if (configuration.getIncludeRzAxis())
  {
    m[currentReportIndex++] = _rZ;
    m[currentReportIndex++] = (_rZ >> 8);
  }
  if (configuration.getIncludeRxAxis())
  {
    m[currentReportIndex++] = _rX;
    m[currentReportIndex++] = (_rX >> 8);
  }
  if (configuration.getIncludeRyAxis())
  {
    m[currentReportIndex++] = _rY;
    m[currentReportIndex++] = (_rY >> 8);
  }

  if (configuration.getIncludeSlider1())
  {
    m[currentReportIndex++] = _slider1;
    m[currentReportIndex++] = (_slider1 >> 8);
  }
  if (configuration.getIncludeSlider2())
  {
    m[currentReportIndex++] = _slider2;
    m[currentReportIndex++] = (_slider2 >> 8);
  }

  if (configuration.getIncludeRudder())
  {
    m[currentReportIndex++] = _rudder;
    m[currentReportIndex++] = (_rudder >> 8);
  }
  if (configuration.getIncludeThrottle())
  {
    m[currentReportIndex++] = _throttle;
    m[currentReportIndex++] = (_throttle >> 8);
  }
  if (configuration.getIncludeAccelerator())
  {
    m[currentReportIndex++] = _accelerator;
    m[currentReportIndex++] = (_accelerator >> 8);
  }
  if (configuration.getIncludeBrake())
  {
    m[currentReportIndex++] = _brake;
    m[currentReportIndex++] = (_brake >> 8);
  }
  if (configuration.getIncludeSteering())
  {
    m[currentReportIndex++] = _steering;
    m[currentReportIndex++] = (_steering >> 8);
  }

  if (configuration.getIncludeGyroscope())
  {
    m[currentReportIndex++] = _gX;
    m[currentReportIndex++] = (_gX >> 8);
    m[currentReportIndex++] = _gY;
    m[currentReportIndex++] = (_gY >> 8);
    m[currentReportIndex++] = _gZ;
    m[currentReportIndex++] = (_gZ >> 8);
  }
  
  if (configuration.getIncludeAccelerometer())
  {
    m[currentReportIndex++] = _aX;
    m[currentReportIndex++] = (_aX >> 8);
    m[currentReportIndex++] = _aY;
    m[currentReportIndex++] = (_aY >> 8);
    m[currentReportIndex++] = _aZ;
    m[currentReportIndex++] = (_aZ >> 8);
  }
  
  if (configuration.getHatSwitchCount() > 0)
  {
    signed char hats[4];

    hats[0] = _hat1;
    hats[1] = _hat2;
    hats[2] = _hat3;
    hats[3] = _hat4;

