lemmingDev/ESP32-BLE-Gamepad/BleGamepad.cpp
void BleGamepad::setRudder(int16_t rudder)
{
  rudder = clampAxis(rudder);

  _rudder = rudder;

  if (configuration.getAutoReport())
  {
    sendReport();
  }
}

void BleGamepad::setThrottle(int16_t throttle)
{
  throttle = clampAxis(throttle);

  _throttle = throttle;

  if (configuration.getAutoReport())
  {
    sendReport();
  }
}

void BleGamepad::setAccelerator(int16_t accelerator)
{
  accelerator = clampAxis(accelerator);

  _accelerator = accelerator;

  if (configuration.getAutoReport())
  {
    sendReport();
  }
}

void BleGamepad::setBrake(int16_t brake)
{
  brake = clampAxis(brake);

  _brake = brake;

  if (configuration.getAutoReport())
  {
    sendReport();
  }
}

void BleGamepad::setSteering(int16_t steering)
{
  steering = clampAxis(steering);

  _steering = steering;

  if (configuration.getAutoReport())
  {
    sendReport();
  }
}

bool BleGamepad::isPressed(uint8_t b)
{
  uint8_t index = (b - 1) / 8;
  uint8_t bit = (b - 1) % 8;
  uint8_t bitmask = (1 << bit);

  if ((bitmask & _buttons[index]) > 0)
    return true;
  return false;
}

bool BleGamepad::isConnected(void)
{
  return this->connectionStatus->connected;
}

void BleGamepad::setBatteryLevel(uint8_t level)
{
  this->batteryLevel = level;
  if (hid != 0)
  {

    this->hid->setBatteryLevel(this->batteryLevel, this->isConnected() ? true : false);

    if (configuration.getAutoReport())
    {
      sendReport();
    }
  }
}

bool BleGamepad::isOutputReceived()
{
  if (enableOutputReport && outputReceiver)
  {
    if (this->outputReceiver->outputFlag)
    {
      this->outputReceiver->outputFlag = false; // Clear Flag
      return true;
    }
  }
  return false;
}

uint8_t* BleGamepad::getOutputBuffer()
{
  if (enableOutputReport && outputReceiver)
  {
    memcpy(outputBackupBuffer, outputReceiver->outputBuffer, outputReportLength); // Creating a backup to avoid buffer being overwritten while processing data
    return outputBackupBuffer;
  }
  return nullptr;
}

bool BleGamepad::isFeatureReceived()
{
  if (enableFeatureReport && featureReceiver)
  {
    if (this->featureReceiver->featureFlag)
    {
      this->featureReceiver->featureFlag = false; // Clear Flag
      return true;
    }
  }
  return false;
}

uint8_t* BleGamepad::getFeatureBuffer()
{
  if (enableFeatureReport && featureReceiver)
  {
    memcpy(featureBackupBuffer, featureReceiver->featureBuffer, featureReportLength); // Creating a backup to avoid buffer being overwritten while processing data
    return featureBackupBuffer;
  }
  return nullptr;
}

void BleGamepad::setFeatureBuffer(const uint8_t* data, uint16_t length)
{
  if (enableFeatureReport && featureReceiver)
  {
    uint16_t copyLength = length < featureReportLength ? length : featureReportLength;
    memcpy(featureReceiver->featureBuffer, data, copyLength);
  }
}

bool BleGamepad::isPlayerLedReceived()
{
  if (enableSInput && sInputReceiver)
  {
    if (this->sInputReceiver->playerLedFlag)
    {
      this->sInputReceiver->playerLedFlag = false; // Clear Flag
      return true;
    }
  }
  return false;
}

uint8_t BleGamepad::getPlayerLedIndex()
{
  if (enableSInput && sInputReceiver)
  {
    return sInputReceiver->playerLedIndex;
  }
  return 0;
}

bool BleGamepad::isRumbleReceived()
{
  if (enableSInput && sInputReceiver)
  {
    if (this->sInputReceiver->rumbleFlag)
    {
      this->sInputReceiver->rumbleFlag = false;
      return true;
    }
  }
  return false;
}

uint8_t BleGamepad::getRumbleLeftAmplitude()
{
  if (enableSInput && sInputReceiver)
  {
    return sInputReceiver->rumbleLeftAmplitude;
  }
  return 0;
}

uint8_t BleGamepad::getRumbleRightAmplitude()
{
  if (enableSInput && sInputReceiver)
  {
    return sInputReceiver->rumbleRightAmplitude;
  }
  return 0;
}

bool BleGamepad::isRgbReceived()
{
  if (enableSInput && sInputReceiver)
  {
    if (this->sInputReceiver->rgbFlag)
    {
      this->sInputReceiver->rgbFlag = false;
      return true;
    }
  }
  return false;
}

uint8_t BleGamepad::getRgbRed()
{
  if (enableSInput && sInputReceiver)
  {
    return sInputReceiver->rgbRed;
  }
  return 0;
}

uint8_t BleGamepad::getRgbGreen()
{
  if (enableSInput && sInputReceiver)
  {
    return sInputReceiver->rgbGreen;
  }
  return 0;
}

uint8_t BleGamepad::getRgbBlue()
{
  if (enableSInput && sInputReceiver)
  {
    return sInputReceiver->rgbBlue;
  }
  return 0;
}

bool BleGamepad::isXInputRumbleReceived()
{
  GamepadMode mode = configuration.getGamepadMode();
  if ((mode == GamepadMode::XInput || mode == GamepadMode::XInputSeriesX) && xInputReceiver)
  {
    if (xInputReceiver->rumbleFlag)
    {
      xInputReceiver->rumbleFlag = false;
      return true;
    }
  }
  return false;
}

uint8_t BleGamepad::getXInputStrongMotor()
{
  GamepadMode mode = configuration.getGamepadMode();
  if ((mode == GamepadMode::XInput || mode == GamepadMode::XInputSeriesX) && xInputReceiver)
  {
    return xInputReceiver->strongMotor;
  }
  return 0;
}

uint8_t BleGamepad::getXInputWeakMotor()
{
  GamepadMode mode = configuration.getGamepadMode();
  if ((mode == GamepadMode::XInput || mode == GamepadMode::XInputSeriesX) && xInputReceiver)
  {
    return xInputReceiver->weakMotor;
  }
  return 0;
}

uint8_t BleGamepad::getXInputLeftTriggerMagnitude()
{
  GamepadMode mode = configuration.getGamepadMode();
  if ((mode == GamepadMode::XInput || mode == GamepadMode::XInputSeriesX) && xInputReceiver)
  {
    return xInputReceiver->leftTriggerMagnitude;
  }
  return 0;
}

uint8_t BleGamepad::getXInputRightTriggerMagnitude()
{
  GamepadMode mode = configuration.getGamepadMode();
  if ((mode == GamepadMode::XInput || mode == GamepadMode::XInputSeriesX) && xInputReceiver)
  {
    return xInputReceiver->rightTriggerMagnitude;
  }
  return 0;
}

bool BleGamepad::deleteAllBonds(bool resetBoard)
{
  bool success = false;

  NimBLEDevice::deleteAllBonds();
  NIMBLE_LOGD(LOG_TAG, "deleteAllBonds - All bonds deleted");
  success = true;
  delay(500);

  if (resetBoard)
  {
    NIMBLE_LOGD(LOG_TAG, "deleteAllBonds - Reboot ESP32");
    ESP.restart();
  }

  return success;	// Returns false if all bonds are not deleted
}

bool BleGamepad::deleteBond(bool resetBoard)
{
  bool success = false;

  NimBLEServer* server = NimBLEDevice::getServer();

  if (server)
  {
    NimBLEConnInfo info = server->getPeerInfo(0);
    NimBLEAddress address = info.getAddress();

    success = NimBLEDevice::deleteBond(address);
    NIMBLE_LOGD(LOG_TAG, "deleteBond - Bond for %s deleted", std::string(address).c_str());

